; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-8-2-3-10-10-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 depot5 depot6 depot7 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 depot5)
	(clear pallet5)
	(at pallet6 depot6)
	(clear crate1)
	(at pallet7 depot7)
	(clear pallet7)
	(at pallet8 distributor0)
	(clear crate0)
	(at pallet9 distributor1)
	(clear crate2)
	(at truck0 depot0)
	(at truck1 depot5)
	(at truck2 depot5)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 depot5)
	(available hoist5)
	(at hoist6 depot6)
	(available hoist6)
	(at hoist7 depot7)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at crate0 distributor0)
	(on crate0 pallet8)
	(at crate1 depot6)
	(on crate1 pallet6)
	(at crate2 distributor1)
	(on crate2 pallet9)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet7)
		(on crate2 crate0)
	)
))

; plan
1. (lift hoist9 crate2 pallet9 distributor1)
   deleted: (at crate2 distributor1) (available hoist9) (on crate2 pallet9) (clear crate2)
   added: (lifting hoist9 crate2) (clear pallet9)
   goals met: 0 of 3
2. (drive truck1 depot5 distributor1)
   deleted: (at truck1 depot5)
   added: (at truck1 distributor1)
   goals met: 0 of 3
3. (load hoist9 crate2 truck1 distributor1)
   deleted: (lifting hoist9 crate2)
   added: (in crate2 truck1) (available hoist9)
   goals met: 0 of 3
4. (lift hoist8 crate0 pallet8 distributor0)
   deleted: (at crate0 distributor0) (available hoist8) (on crate0 pallet8) (clear crate0)
   added: (lifting hoist8 crate0) (clear pallet8)
   goals met: 0 of 3
5. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 0 of 3
6. (load hoist8 crate0 truck1 distributor0)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck1) (available hoist8)
   goals met: 0 of 3
7. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 0 of 3
8. (unload hoist2 crate0 truck1 depot2)
   deleted: (available hoist2) (in crate0 truck1)
   added: (lifting hoist2 crate0)
   goals met: 0 of 3
9. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (at crate0 depot2) (available hoist2) (on crate0 pallet2) (clear crate0)
   goals met: 1 of 3
10. (drive truck0 depot0 depot6)
   deleted: (at truck0 depot0)
   added: (at truck0 depot6)
   goals met: 1 of 3
11. (lift hoist6 crate1 pallet6 depot6)
   deleted: (at crate1 depot6) (available hoist6) (on crate1 pallet6) (clear crate1)
   added: (lifting hoist6 crate1) (clear pallet6)
   goals met: 1 of 3
12. (load hoist6 crate1 truck0 depot6)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   goals met: 1 of 3
13. (drive truck0 depot6 depot7)
   deleted: (at truck0 depot6)
   added: (at truck0 depot7)
   goals met: 1 of 3
14. (unload hoist2 crate2 truck1 depot2)
   deleted: (available hoist2) (in crate2 truck1)
   added: (lifting hoist2 crate2)
   goals met: 1 of 3
15. (drop hoist2 crate2 crate0 depot2)
   deleted: (lifting hoist2 crate2) (clear crate0)
   added: (at crate2 depot2) (available hoist2) (on crate2 crate0) (clear crate2)
   goals met: 2 of 3
16. (unload hoist7 crate1 truck0 depot7)
   deleted: (available hoist7) (in crate1 truck0)
   added: (lifting hoist7 crate1)
   goals met: 2 of 3
17. (drop hoist7 crate1 pallet7 depot7)
   deleted: (lifting hoist7 crate1) (clear pallet7)
   added: (at crate1 depot7) (available hoist7) (on crate1 pallet7) (clear crate1)
   goals met: 3 of 3
